import {IColumn} from "../table/table.component";

export const dataTable: string[][] = [
  [
    "23 дек, 9:00",
    "Страхование с заботой о клиенте",
    "12",
    "",
    "12",
  ],
  [
    "23 дек, 10:00",
    "Страхование с заботой о клиенте",
    "12",
    "",
    "76",
  ],
  [
    "23 дек, 9:30",
    "Страхование с заботой о клиенте",
    "12",
    "",
    "86",
  ]
];

// export const dataTable: string[][] = [
//   [
//     "23 дек, 9:00",
//     "14 ноя, 9:30",
//     "14 ноя, 8:30"
//   ],
//   [
//     "Страхование с заботой о клиенте",
//     "Страхование с заботой о клиенте",
//     "Страхование с заботой о клиенте"
//   ],
//   [
//     "12",
//     "12",
//     "12",
//   ],
//   [
//     "",
//     "",
//     "",
//   ],
//   [
//     "12",
//     "76",
//     "86"
//   ]
// ];

export const settingsColumns: IColumn[] = [
  {
    name: "Дата начала",
    type: "string"
  },
  {
    name: "Название",
    type: "string",
    isFlexGrow: true
  },
  {
    name: "Участников",
    type: "string"
  },
  {
    name: "Тренер",
    type: "string",
    isNoneDisplayInMobile: true
  },
  {
    name: "Прогресс",
    type: "percent"
  }
];
